<%@ page language="java" contentType="text/html; charset=EUC-KR"
    pageEncoding="EUC-KR"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="EUC-KR">
<title>EL 테스트</title>
</head>
<body>
	<h2>EL의 연산자들</h2>
	<hr>
	\${200+100} : ${200+100} <br>
	\${200-100} : ${200-100} <br>
	\${200/100} : ${200/100} <br>
	\${200>100} : ${200>100} <br>
	\${200==100} : ${200==100} <br>
	\${200!=100} : ${200!=100} <br>
	
	\${'10' -10 } : ${'10' -10 } <br>
	\${10 * "10" } : ${10 * "10"} <br>
	\${40 div 5} : ${40 div 5} <br>
	\${40 mod 5} : ${40 mod 5} <br>
	
	\${10 eq 10} : ${10 eq 10} <br>
	\${10 lt 10} : ${10 lt 10} <br>
	\${10 gt 10} : ${10 gt 10} <br>
	\${10 le 10} : ${10 le 10} <br>
	\${10 ge 10} : ${10 ge 10} <br>
	
	\${10 > 5? 'A' : 'B' } : ${10 > 5? 'A' : 'B' } <br>
	\${100 + 200 + 300} : ${100 + 200 + 300} <br>
	\${100 += 200 += 300} : ${100 += 200 += 300} <br>
	\${"EL" += 12 += 34 += "-문자열 결합연산"} : ${"EL" += 12 += 34 += "-문자열 결합연산"} <br>
	
</body>
</html>